# Lending Assignment

In [1]:
import pandas as pd

In [4]:
ld = pd.read_csv('LD_1a.csv')

In [6]:
ld

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,Unnamed: 10,"Amount ($1,000).2",Number .2,CC Amount/TA1
0,NaN,NaN,-1,-2,-3,-4,-5,-6,-7,-8,NaN,-9,-10,-11
1,American Express Co.,NY,1,0.238,1,"1,63,50,038","36,03,226",>$50B,"1,63,18,089","36,03,088",NaN,"31,949",138,0.28
2,First Citizens Banchares,NC,2,0.187,0.491,"39,14,507","1,17,702",$10B-$50B,"3,78,394","1,05,081",NaN,"35,36,113","12,621",.
3,Wintrust Financial Corp.,IL,3,0.169,0.384,"28,42,793","1,36,801",$10B-$50B,"8,00,526","1,26,455",NaN,"20,42,267","10,346",0
4,Zions Bancorp,UT,4,0.118,0.261,"62,31,770","52,612",>$50B,"5,26,206","32,973",NaN,"57,05,564","19,639",0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
89,USAA Svg. Bank,NV,NR,0,-,-,1,>$10B,-,1,NaN,-,-,.
90,State Street Corp.,MA,NR,-,-,-,-,>$50B,-,-,NaN,-,-,0
91,E Trade Bk,VA,NR,-,-,-,-,>$10B,-,-,NaN,-,-,.
92,Charles Schwab Bk,NV,NR,-,-,-,-,>$10B,-,-,NaN,-,-,.
93,Third FS&LA,OH,NR,-,-,-,-,>$10B,-,-,NaN,-,-,.

## 1. Clean Rank with Matching Ranking value or '0'

In [15]:
ld.Rank = ld.Rank.replace('NR', 0)

## 6. Make sure every column in its respective data type.

In [74]:
ld = ld.astype({'Name of Lending Institution' :str})

In [25]:
ld['TA Ratio1'] = pd.to_numeric(ld['TA Ratio1'], errors = 'coerce')

In [28]:
ld['TBL Ratio1'] = pd.to_numeric(ld['TBL Ratio1'], errors = 'coerce')

In [29]:
ld['Amount ($1,000)'] = pd.to_numeric(ld['Amount ($1,000)'], errors = 'coerce')

In [31]:
ld['Number '] = pd.to_numeric(ld['Number '], errors = 'coerce')

In [36]:
ld['Amount ($1,000).1'] = pd.to_numeric(ld['Amount ($1,000).1'], errors = 'coerce')

In [37]:
ld['Number .1'] = pd.to_numeric(ld['Number .1'], errors = 'coerce')

In [38]:
ld['Amount ($1,000).2'] = pd.to_numeric(ld['Amount ($1,000).2'], errors = 'coerce')

In [39]:
ld['Number .2'] = pd.to_numeric(ld['Number .2'], errors = 'coerce')

In [51]:
ld['CC Amount/TA1'] = pd.to_numeric(ld['CC Amount/TA1'], errors = 'coerce')

## 2. Clean '-' values with column mean

In [42]:
ld['TA Ratio1'] = ld['TA Ratio1'].fillna(ld['TA Ratio1'].mean())

In [44]:
ld['TBL Ratio1'] = ld['TA Ratio1'].fillna(ld['TBL Ratio1'].mean())

In [45]:
ld['Amount ($1,000)'] = ld['TA Ratio1'].fillna(ld['Amount ($1,000)'].mean())

In [46]:
ld['Amount ($1,000).1'] = ld['TA Ratio1'].fillna(ld['Amount ($1,000).1'].mean())

In [47]:
ld['Amount ($1,000).2'] = ld['TA Ratio1'].fillna(ld['Amount ($1,000).2'].mean())

In [48]:
ld['Number '] = ld['TA Ratio1'].fillna(ld['Number '].mean())

In [49]:
ld['Number .1'] = ld['TA Ratio1'].fillna(ld['Number .1'].mean())

In [50]:
ld['Number .2'] = ld['TA Ratio1'].fillna(ld['Number .2'].mean())

## 3. Clean '.' values with column mean

In [52]:
ld['CC Amount/TA1'] = ld['TA Ratio1'].fillna(ld['CC Amount/TA1'].mean())

## 4. Convert Lending Asset Size = Category like 0, 1, 2 etc based on levels available

In [128]:
ld['Lender Asset Size'] = ld['Lender Asset Size'].replace([' $10B-$50B            ',' >$10B                ', '>$10B               ', '>$50B               ', ' >$50B                ', '-6'], 0)

In [129]:
ld.groupby('Lender Asset Size').count()

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,"Amount ($1,000).1",Number .1,Unnamed: 10,"Amount ($1,000).2",Number .2,CC Amount/TA1
Lender Asset Size,,,,,,,,,,,,,
0,43,43,43,43,43,43,43,43,43,0,43,43,43
1,18,18,18,18,18,18,18,18,18,0,18,18,18
2,32,32,32,32,32,32,32,32,32,0,32,32,32
3,1,1,1,1,1,1,1,1,1,0,1,1,1